In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os
from collections import Counter
# print(os.listdir("../input"))

In [2]:
# data = pd.read_csv('../input/imbd-sf/data.csv')
data = pd.read_csv('data.csv')
data.head(5)

,imdb_id,popularity,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_count,vote_average,release_year
0,tt0369610,32.985763,150000000,1513528810,Jurassic World,Chris Pratt|Bryce Dallas Howard|Irrfan Khan|Vi...,Colin Trevorrow,The park is open.,Twenty-two years after the events of Jurassic ...,124,Action|Adventure|Science Fiction|Thriller,Universal Studios|Amblin Entertainment|Legenda...,6/9/2015,5562,6.5,2015
1,tt1392190,28.419936,150000000,378436354,Mad Max: Fury Road,Tom Hardy|Charlize Theron|Hugh Keays-Byrne|Nic...,George Miller,What a Lovely Day.,An apocalyptic story set in the furthest reach...,120,Action|Adventure|Science Fiction|Thriller,Village Roadshow Pictures|Kennedy Miller Produ...,5/13/2015,6185,7.1,2015
2,tt2908446,13.112507,110000000,295238201,Insurgent,Shailene Woodley|Theo James|Kate Winslet|Ansel...,Robert Schwentke,One Choice Can Destroy You,Beatrice Prior must confront her inner demons ...,119,Adventure|Science Fiction|Thriller,Summit Entertainment|Mandeville Films|Red Wago...,3/18/2015,2480,6.3,2015
3,tt2488496,11.173104,200000000,2068178225,Star Wars: The Force Awakens,Harrison Ford|Mark Hamill|Carrie Fisher|Adam D...,J.J. Abrams,Every generation has a story.,Thirty years after defeating the Galactic Empi...,136,Action|Adventure|Science Fiction|Fantasy,Lucasfilm|Truenorth Productions|Bad Robot,12/15/2015,5292,7.5,2015
4,tt2820852,9.335014,190000000,1506249360,Furious 7,Vin Diesel|Paul Walker|Jason Statham|Michelle ...,James Wan,Vengeance Hits Home,Deckard Shaw seeks revenge against Dominic Tor...,137,Action|Crime|Thriller,Universal Pictures|Original Film|Media Rights ...,4/1/2015,2947,7.3,2015

In [3]:
data.shape

(1890, 16)

In [4]:
len(data)

1890

# Предобработка датасета

In [5]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста
# сюда можем вписать создание новых колонок в датасете

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [6]:
# тут вводим ваш ответ и добавлем в его список ответов (сейчас для примера стоит "1")
movies_list = 'tt1345836,tt0413300,tt2395427,tt1032751,tt1298650'.split(',')
display(data.query('imdb_id.isin(@movies_list)'
                  ).sort_values(by='budget',
                                ascending=False)[['budget',
                                                  'imdb_id',
                                                  'original_title']])

answer_ls.append(4)

         budget    imdb_id                               original_title
491   425000000  tt1032751                            The Warrior's Way
724   380000000  tt1298650  Pirates of the Caribbean: On Stranger Tides
14    280000000  tt2395427                      Avengers: Age of Ultron
1677  258000000  tt0413300                                 Spider-Man 3
973   250000000  tt1345836                        The Dark Knight Rises

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [7]:
movies_list = 'tt0167260,tt0279111,tt0360717,tt0213149,tt0346491'.split(',')

display(data.query('imdb_id.isin(@movies_list)'
                  ).sort_values(by='runtime',
                                ascending=False)[['runtime',
                                                  'imdb_id',
                                                  'original_title']
                                                ]
       )


answer_ls.append(2)

      runtime    imdb_id                                 original_title
1158      214  tt0279111                              Gods and Generals
1082      201  tt0167260  The Lord of the Rings: The Return of the King
1337      187  tt0360717                                      King Kong
505       183  tt0213149                                   Pearl Harbor
1602      175  tt0346491                                      Alexander

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [8]:
movies_list = 'tt0299172,tt0283426,tt1449283,tt0121164,tt0443536'.split(',')

display(data.query('imdb_id.isin(@movies_list)'
                  ).sort_values(by='runtime')[['runtime',
                                               'imdb_id',
                                               'original_title'
                                              ]
                                             ]
       )

      runtime    imdb_id     original_title
769        63  tt1449283    Winnie the Pooh
1098       72  tt0283426  The Jungle Book 2
1627       76  tt0299172  Home on the Range
1349       77  tt0121164       Corpse Bride
1360       80  tt0443536        Hoodwinked!

In [9]:
answer_ls.append(3)

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [10]:
data.runtime.mean().round()

110.0

In [11]:
answer_ls.append(2)

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [12]:
data.runtime.median().round()

106.0

In [13]:
answer_ls.append(1)

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [14]:
import copy
movies_list = 'tt0848228,tt2293640,tt2488496,tt2820852,tt0499549'.split(',')

df = copy.copy(data.query('imdb_id.isin(@movies_list)'))

df['profit'] = df.revenue - df.budget
display(df.sort_values(by='profit',
                       ascending=False)[['profit',
                                         'imdb_id',
                                         'original_title']])

         profit    imdb_id                original_title
239  2544505847  tt0499549                        Avatar
3    1868178225  tt2488496  Star Wars: The Force Awakens
4    1316249360  tt2820852                     Furious 7
971  1299557910  tt0848228                  The Avengers
8    1082730962  tt2293640                       Minions

In [15]:
answer_ls.append(5)

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [16]:
import copy
movies_list = 'tt0134983,tt1032751,tt0424095,tt0180052,tt1210819'.split(',')

df = copy.copy(data.query('imdb_id.isin(@movies_list)'))

df['profit'] = df.revenue - df.budget
display(df.sort_values(by='profit')[['profit',
                                     'imdb_id',
                                     'original_title']])

         profit    imdb_id                original_title
491  -413912431  tt1032751             The Warrior's Way
1246 -165710090  tt1210819               The Lone Ranger
959   -92896027  tt0180052  The Adventures of Pluto Nash
1465  -84540684  tt0424095                  Flushed Away
1873  -75171919  tt0134983                     Supernova

In [17]:
answer_ls.append(2)

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [18]:
len(data.query('revenue > budget'))

1478

In [19]:
answer_ls.append(1)

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [20]:
import copy
movies_list = 'tt0479952,tt0371746,tt0441773,tt0468569,tt0795421'.split(',')

df = copy.copy(data.query('imdb_id.isin(@movies_list) & release_year==2008'))

df['profit'] = df.revenue - df.budget
display(df.sort_values(by='profit', 
                       ascending=False)[['profit',
                                         'release_year',
                                         'imdb_id',
                                         'original_title']])

        profit  release_year    imdb_id               original_title
600  816921825          2008  tt0468569              The Dark Knight
608  557841637          2008  tt0795421                   Mamma Mia!
607  501744560          2008  tt0441773                Kung Fu Panda
613  453900354          2008  tt0479952  Madagascar: Escape 2 Africa
602  445174222          2008  tt0371746                     Iron Man

In [21]:
answer_ls.append(4)

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [22]:
import copy
movies_list = 'tt1837709,tt1656186,tt1235522,tt1374992,tt1210819'.split(',')

df = copy.copy(data.query('imdb_id.isin(@movies_list) & 2012<=release_year<=2014'))

df['profit'] = df.revenue - df.budget
display(df.sort_values(by='profit', 
                       ascending=True)[['profit',
                                        'release_year',
                                        'imdb_id',
                                        'original_title']])

         profit  release_year    imdb_id   original_title
1246 -165710090          2013  tt1210819  The Lone Ranger
1008  -51893525          2012  tt1374992      Upside Down
1279  -36298836          2013  tt1235522      Broken City
1034  -32893443          2012  tt1656186           Stolen
216   -29199769          2014  tt1837709    Winter's Tale

In [23]:
answer_ls.append(5)

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [24]:
# genre_list = 'Action,Adventure,Drama,Comedy,Thriller'.split(',')
# pd.DataFrame(list(map(lambda x: [x,len(data[data.genres.str.contains(x)])], genre_list))).sort_values(by=1, ascending=False)

In [25]:
genre_list = 'Action,Adventure,Drama,Comedy,Thriller'.split(',')
pd.Series(data.genres.apply(lambda s: str(s).split('|')
                           ).sum()
          ).value_counts()[genre_list
                          ].sort_values(ascending=False)

Drama        782
Comedy       683
Thriller     597
Action       583
Adventure    416
dtype: int64

In [26]:
answer_ls.append(3)

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [27]:
import copy
genre_list = 'Action,Adventure,Drama,Comedy,Thriller'.split(',')

df = copy.copy(data.query('revenue > budget'))
pd.Series(df.genres.apply(lambda s: str(s).split('|')
                         ).sum()
         ).value_counts()[genre_list
                         ].sort_values(ascending=False)

Drama        560
Comedy       551
Thriller     446
Action       444
Adventure    337
dtype: int64

In [28]:
# import copy
# df = copy.copy(data.query('revenue > budget'))
# genre_list = 'Action,Adventure,Drama,Comedy,Thriller'.split(',')
# pd.DataFrame(list(map(lambda x: [x,len(df[df.genres.str.contains(x)])], genre_list))).sort_values(by=1, ascending=False)

In [29]:
answer_ls.append(1)

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [30]:
import copy

director_list = 'Steven Spielberg,Ridley Scott,Steven Soderbergh,Christopher Nolan,Clint Eastwood'.split(',')

# pd.DataFrame(list(map(lambda x: [x,len(data[data.director.str.contains(x)])], director_list))).sort_values(by=1, ascending=False)

pd.Series(data.director.apply(lambda s: str(s).split('|')
                             ).sum()
         ).value_counts()[director_list
                         ].sort_values(ascending=False)

Steven Soderbergh    13
Clint Eastwood       12
Ridley Scott         12
Steven Spielberg     10
Christopher Nolan     8
dtype: int64

In [31]:
answer_ls.append(3)

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [32]:
import copy
director_list = 'Steven Spielberg,Ridley Scott,Steven Soderbergh,Christopher Nolan,Clint Eastwood'.split(',')

df = copy.copy(data.query('revenue > budget'))

pd.Series(df.director.apply(lambda s: str(s).split('|')
                           ).sum()
         ).value_counts()[director_list
                         ].sort_values(ascending=False)


# pd.DataFrame(list(map(lambda x: [x,len(data[data.director.str.contains(x)].query('revenue > budget'))], 
#                       director_list))).sort_values(by=1, ascending=False)

Ridley Scott         12
Clint Eastwood       10
Steven Soderbergh    10
Steven Spielberg     10
Christopher Nolan     8
dtype: int64

In [33]:
answer_ls.append(4)

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [34]:
import copy

director_list = 'Steven Spielberg,Christopher Nolan,David Yates,James Cameron,Peter Jackson'.split(',')

df = copy.copy(data)
df['profit'] = df.revenue - df.budget

pd.DataFrame(list(map(lambda x: 
                      [x,df[df.director.str.contains(x)].profit.sum()], 
                      director_list)), columns = ['director',
                                                  'total_profit']
            ).sort_values(by='total_profit', 
                          ascending=False)

            director  total_profit
4      Peter Jackson    5202593685
2        David Yates    3379295625
1  Christopher Nolan    3162548502
3      James Cameron    2548546718
0   Steven Spielberg    2449700791

In [35]:
answer_ls.append(2)

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [36]:
import copy

actor_list = 'Emma Watson,Johnny Depp,Michelle Rodriguez,Orlando Bloom,Rupert Grint'.split(',')

df = copy.copy(data) 
df['profit'] = df.revenue - df.budget

pd.DataFrame(list(map(lambda x: 
                      [x,df[df.cast.str.contains(x)].profit.sum()],
                      actor_list)), columns = ['actor',
                                               'total_profit']
            ).sort_values(by='total_profit', 
                          ascending=False)

                actor  total_profit
0         Emma Watson    6666245597
4        Rupert Grint    6408638290
3       Orlando Bloom    5148578162
1         Johnny Depp    4776417000
2  Michelle Rodriguez    4608031235

In [37]:
answer_ls.append(1)

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [38]:
import copy

actor_list = 'Nicolas Cage,Danny Huston,Kirsten Dunst,Jim Sturgess,Sami Gayle'.split(',')

df = copy.copy(data.query('release_year == 2012')) 
df['profit'] = df.revenue - df.budget


pd.DataFrame(list(map(lambda x: 
                      [x,df[df.cast.str.contains(x)].profit.sum()],
                      actor_list)), columns = ['actor',
                                               'total_profit']
            ).sort_values(by='total_profit', 
                          ascending=True)

           actor  total_profit
2  Kirsten Dunst     -68109207
0   Nicolas Cage     -32893443
1   Danny Huston     -32893443
4     Sami Gayle     -32893443
3   Jim Sturgess     -23410657

In [39]:
answer_ls.append(3)

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [40]:
import copy
actor_list = 'Tom Cruise,Mark Wahlberg,Matt Damon,Angelina Jolie,Adam Sandler'.split(',')

df = copy.copy(data.query('budget > budget.mean()'))
pd.Series(df.cast.apply(lambda s: 
                        str(s).split('|')).sum()
         ).value_counts()[actor_list].sort_values(ascending=False)

Matt Damon        18
Adam Sandler      17
Angelina Jolie    16
Tom Cruise        15
Mark Wahlberg     14
dtype: int64

In [41]:
answer_ls.append(3)

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [42]:
import copy

genre_list = 'Drama,Action,Thriller,Adventure,Crime'.split(',')

df = copy.copy(data.query('cast.str.contains("Nicolas Cage")'))

pd.Series(df.genres.apply(lambda s: 
                          str(s).split('|')).sum()
         ).value_counts()[genre_list].sort_values(ascending=False)

Action       17
Thriller     15
Drama        12
Crime        10
Adventure     7
dtype: int64

In [43]:
answer_ls.append(2)

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [44]:
import copy

comp_list = 'Universal,Paramount Pictures,Columbia Pictures,Warner Bros,Twentieth Century Fox Film Corporation'.split(',')

df = copy.copy(data)

pd.DataFrame(list(map(lambda x: 
                      [x,len(df[df.production_companies.str.contains(x)])], 
                      comp_list)), columns = ['company',
                                              'count']
            ).sort_values(by='count', 
                          ascending=False)

                                  company  count
0                               Universal    185
3                             Warner Bros    183
2                       Columbia Pictures    163
1                      Paramount Pictures    122
4  Twentieth Century Fox Film Corporation    109

In [45]:
answer_ls.append(1)

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [46]:
import copy

comp_list = 'Universal Pictures,Paramount Pictures,Columbia Pictures,Warner Bros,Twentieth Century Fox Film Corporation'.split(',')

df = copy.copy(data.query('release_year == 2015'))

pd.DataFrame(list(map(lambda x: 
                      [x,len(df[df.production_companies.str.contains(x)])], 
                      comp_list)), columns = ['company',
                                              'count']).sort_values(by='count', 
                                                                    ascending=False)

                                  company  count
3                             Warner Bros     12
0                      Universal Pictures     11
4  Twentieth Century Fox Film Corporation      8
1                      Paramount Pictures      7
2                       Columbia Pictures      7

In [47]:
answer_ls.append(4)

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [48]:
import copy

comp_list = 'Universal,Paramount Pictures,Columbia Pictures,Warner Bros,Walt Disney'.split(',')

df = copy.copy(data)
df['profit'] = df.revenue - df.budget
pd.DataFrame(list(map(lambda x: 
                      [x,df[df.production_companies.str.contains(x)].profit.sum()],
                      comp_list)), columns = ['company',
                                              'total_profit']).sort_values(by='total_profit', 
                                                                           ascending=False)

              company  total_profit
3         Warner Bros   24543602472
0           Universal   22917999940
4         Walt Disney   19627468070
2   Columbia Pictures   19369987985
1  Paramount Pictures   14303898690

In [49]:
answer_ls.append(3)

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [50]:
import copy

comp_list = 'Universal,Paramount Pictures,Columbia Pictures,Warner Bros,Lucasfilm'.split(',')

df = copy.copy(data.query('release_year == 2012'))
df['profit'] = df.revenue - df.budget
pd.DataFrame(list(map(lambda x: 
                      [x,df[df.production_companies.str.contains(x)].profit.sum()],
                      comp_list)), columns = ['company',
                                              'total_profit']).sort_values(by='total_profit', 
                                                                           ascending=False)

              company  total_profit
2   Columbia Pictures    2501406608
0           Universal    1981011579
3         Warner Bros    1258020056
1  Paramount Pictures     410726715
4           Lucasfilm      -7634623

In [51]:
answer_ls.append(3)

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [52]:
import copy

id_list = 'tt0267626,tt0435705,tt0315297,tt0811138,tt0964517'.split(',')

df = copy.copy(data.query('production_companies.str.contains("Paramount Pictures") & imdb_id.isin(@id_list)'))

df['profit'] = df.revenue - df.budget

df[['imdb_id',
    'original_title',
    'profit', 
    'production_companies']].sort_values(by='profit',
                                         ascending=True)

,imdb_id,original_title,profit,production_companies
926,tt0267626,K-19: The Widowmaker,-64831034,Paramount Pictures|Intermedia Films|National G...
1723,tt0435705,Next,-51788987,Paramount Pictures|Virtual Studios|Revolution ...
1632,tt0315297,Twisted,-24805000,Paramount Pictures|Kopelson Entertainment|Harl...
668,tt0811138,The Love Guru,-20180936,Paramount Pictures|Goldcrest Pictures|Internat...
436,tt0964517,The Fighter,-15809131,Paramount Pictures

In [53]:
answer_ls.append(1)

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [54]:
import copy
year_list = [2014,2008,2012,2002,2015]

df = copy.copy(data.query('release_year.isin(@year_list)'))

df['profit'] = df.revenue - df.budget
df[['release_year','profit']].groupby(by='release_year'
                                     ).sum().sort_values(by='profit', 
                                                         ascending=False)

                   profit
release_year
2015          18668572378
2014          16397812953
2012          16077001687
2008          11663881990
2002           9002361487

In [55]:
answer_ls.append(5)

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [56]:
import copy
year_list = [2014,2008,2012,2010,2015]

df = copy.copy(data.query('release_year.isin(@year_list) & production_companies.str.contains("Warner Bros")'))

df['profit'] = df.revenue - df.budget
df[['release_year','profit']].groupby(by='release_year'
                                     ).sum().sort_values(by='profit', 
                                                         ascending=False)

                  profit
release_year
2014          2295464519
2008          2134595031
2010          1974712985
2012          1258020056
2015           870368348

In [57]:
answer_ls.append(1)

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [58]:
import copy

month_list = '1/,6/,12/,9/,5/'.split(',')

pd.DataFrame(list(map(lambda x: 
                      [x,len(data[data.release_date.str.match(x)])], 
                      month_list)), columns = ['month',
                                               'film_number']).sort_values(by='film_number', 
                                                                           ascending=False)

  month  film_number
3    9/          227
2   12/          191
1    6/          147
4    5/          140
0    1/          110

In [59]:
answer_ls.append(4)

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [60]:
import copy
df = copy.copy(data.query(
    'release_date.str.match("6/")|release_date.str.match("7/")|release_date.str.match("8/")'
                         )
              )
len(df)

450

In [61]:
answer_ls.append(2)

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [62]:
import copy

director_list = 'Steven Soderbergh,Christopher Nolan,Clint Eastwood,Ridley Scott,Peter Jackson'.split(',')

df = copy.copy(data.query('release_date.str.match("12/")|release_date.str.match("1/")|release_date.str.match("2/")'))

pd.DataFrame(list(map(lambda x: 
                      [x, len(df[df.director.str.contains(x)])], 
                      director_list)), columns = ['director', 
                                                  'films_number']
            ).sort_values(by='films_number', 
                          ascending=False)

            director  films_number
4      Peter Jackson             7
0  Steven Soderbergh             6
2     Clint Eastwood             6
3       Ridley Scott             3
1  Christopher Nolan             0

In [63]:
answer_ls.append(5)

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [64]:
import copy

month_list = '1/,6/,12/,9/,5/'.split(',')
df = copy.copy(data.query('revenue > budget'))

pd.DataFrame(list(map(lambda x: 
                      [x, len(df[df.release_date.str.match(x)])], 
                      month_list)), columns = ['director', 
                                               'month_appearence']
            ).sort_values(by='month_appearence', 
                          ascending=False)

  director  month_appearence
2      12/               159
3       9/               153
1       6/               124
4       5/               120
0       1/                86

In [65]:
answer_ls.append(2)

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [66]:
import copy
companies_list = 'Universal,Warner Bros,Jim Henson Company,Paramount Pictures,Four By Two Productions'.split(',')
df = copy.copy(data)
df['title_lenth'] = df.original_title.apply(lambda s: len(str(s).replace(' ', '')))

pd.DataFrame(list(map(lambda x: 
                      [x, df[df.production_companies.str.contains(x)].title_lenth.mean()], 
                      companies_list)), columns = ['company', 
                                                   'mean_title_len']
            ).sort_values(by='mean_title_len',
                          ascending=False)

                   company  mean_title_len
4  Four By Two Productions       72.000000
2       Jim Henson Company       50.000000
3       Paramount Pictures       15.163934
1              Warner Bros       13.519126
0                Universal       13.135135

In [67]:
answer_ls.append(5)

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [68]:
# data.query('original_title.str.contains("&")').original_title
import copy

companies_list = 'Universal,Warner Bros,Jim Henson Company,Paramount Pictures,Four By Two Productions'.split(',')

df = copy.copy(data)
df['lenth'] = df.original_title.apply(lambda x: len(x.split()))

pd.DataFrame(list(map(lambda x: 
                      [x, df[df.production_companies.str.contains(x)].lenth.mean()], companies_list)), 
             columns = ['company', 
                        'mean_title_len']
            ).sort_values(by='mean_title_len',
                          ascending=False)

                   company  mean_title_len
4  Four By Two Productions       12.000000
2       Jim Henson Company       10.000000
3       Paramount Pictures        2.868852
1              Warner Bros        2.732240
0                Universal        2.627027

In [69]:
answer_ls.append(5)

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [70]:
# We create the function word()
#   that make a list of words
#      used in a specific column of a data.

from collections import Counter as c
import copy

def word(column):
    
    """The function word() create a list of words
       that were used in a specific column of a data."""
    
    list_ = []
    for i in range(len(column)):
        list_.extend(column[i].lower().split())
    return list_

# Using the Counter from the collections package
# we calculcalate the number of unique words.

# NOTE: here the words "king!" and "king" 
#       are supposed to be diferent words.

df = copy.copy(data)
word_list = word(df.original_title)
word_dict = c(word_list)
len(word_dict.keys())

2461

In [71]:
answer_ls.append(3)

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King, Upside Down
4. 300, Lucky Number Slevin
5. Upside Down, 300, Inside Out, The Lord of the Rings: The Return of the King

In [72]:
best_left = data.vote_average.quantile(q=0.99)
data.query('vote_average > @best_left')[['original_title',
                                         'vote_average']
                                       ].sort_values(by='vote_average', 
                                                     ascending=False)

                                     original_title  vote_average
600                                 The Dark Knight           8.1
9                                        Inside Out           8.0
34                                             Room           8.0
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
119                         Guardians of the Galaxy           7.9
128                                       Gone Girl           7.9
138                        The Grand Budapest Hotel           7.9
370                                       Inception           7.9
873                                     The Pianist           7.9
1082  The Lord of the Rings: The Return of the King           7.9
1184                        The Wolf of Wall Street           7.9
1192                               12 Years a Slave           7.9
1801                                        Memento           7.9

In [73]:
answer_ls.append(1)

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [74]:
import copy

duet_list = list(zip('Johnny Depp,Hugh Jackman,Vin Diesel,Adam Sandler,Daniel Radcliffe'.split(','),
                     'Helena Bonham Carter,Ian McKellen,Paul Walker,Kevin James,Rupert Grint'.split(',')))
df = copy.copy(data)
pd.DataFrame(list(map(lambda x: 
                      [x, len(df.query('cast.str.contains(@x[0])&cast.str.contains(@x[1])'))
                      ], duet_list)), columns = ['duet', 
                                                 'films_count']
            ).sort_values(by='films_count', 
                          ascending=False)

                                  duet  films_count
4     (Daniel Radcliffe, Rupert Grint)            8
0  (Johnny Depp, Helena Bonham Carter)            6
1         (Hugh Jackman, Ian McKellen)            5
2            (Vin Diesel, Paul Walker)            5
3          (Adam Sandler, Kevin James)            5

In [75]:
answer_ls.append(1)

# 36. У какого из режиссеров самый высокий процент фильмов со сборами выше бюджета?
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [76]:
director_list = 'Quentin Tarantino,Steven Soderbergh,Robert Rodriguez,Christopher Nolan,Clint Eastwood'.split(',')

import copy

df = copy.copy(data)

pd.DataFrame(list(map(lambda x: 
                      [x, len(df.query('director.str.contains(@x) & revenue > budget')
                             )/len(df.query('director.str.contains(@x)'))],
                      director_list)), columns=['director',
                                                'profit_in_per']
            ).sort_values(by='profit_in_per', 
                          ascending=False)

            director  profit_in_per
3  Christopher Nolan       1.000000
0  Quentin Tarantino       0.857143
4     Clint Eastwood       0.833333
1  Steven Soderbergh       0.769231
2   Robert Rodriguez       0.727273

In [77]:
answer_ls.append(4)

# Submission

In [78]:
len(answer_ls)

36

In [79]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       2
7    8       1
8    9       4
9   10       5
10  11       3
11  12       1
12  13       3
13  14       4
14  15       2
15  16       1
16  17       3
17  18       3
18  19       2
19  20       1
20  21       4
21  22       3
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       5
29  30       2
30  31       5
31  32       5
32  33       3
33  34       1
34  35       1
35  36       4